name: "image_decode"
backend: "python"
max_batch_size: 0

input [
  {
    name: "INPUT_IMAGE_B64"
    data_type: TYPE_STRING
    dims: [ 1 ]  # single string
  }
]

output [
  {
    name: "OUTPUT_IMAGE_TENSOR"
    data_type: TYPE_FP32
    dims: [ -1, -1, 3 ]  # dynamic height, width, 3 channels
  }
]

instance_group [
  { kind: KIND_CPU }  # we can also use KIND_GPU if desired
]
